# { タイトル, 問題文, 答え }

puts "┌──────────────────────────────────────┐"
puts "│　〜「虫食い問題と答え」作成ツール〜　│"
puts "└──────────────────────────────────────┘"
puts "\n ①、②、③の入力例 "
puts "┌────────────────────────────────────────────────┐"
puts "│空についてまなぼう！　　　　　　　　　　　　　　│"
puts "│青空は、レイリー散乱の周波数特性によるものです。│"
puts "│レイリー散乱　　　　　　　　　　　　　　　　　　│"
puts "└────────────────────────────────────────────────┘"
puts "\n───── ① 題名 ② 文章 ③ 単語 を入力してください ─────"
puts ""
title = gets.chomp
question = gets.chomp
word = gets.chomp
puts "\n────────── ↓ [Q.問題] と [A.答え] です ↓ ──────────"
puts "\nテックキャンプで「~#{title}~」の学習を修了しました！"
puts "Q."
puts "#{question.gsub(/#{word}/,'【　　】')}"
puts "A."
puts question
puts "\n─────────────────────────────────────────────────────"
